sunplus-plus1/arduino_core_sunplus_q654/variants/sp7021_evb/variant.h
//void SystemClock_Config(void);
#define SERIAL_UART_INSTANCE	1
#define SPI_SEL_INSTANCE	0    //select spi . SPI0--SPI4

#define PIN_SERIAL_TX	GPIO_P2_02
#define PIN_SERIAL_RX	GPIO_P2_00

#define PIN_SPI_MISO	GPIO_P8_07
#define PIN_SPI_MOSI	GPIO_P8_07
#define PIN_SPI_SCK 	GPIO_P8_07

#define NUM_DIGITAL_PINS	(GPIO_P8_07+1)








